{
	"_title": "2014-2015 Exam",
	"_date": "Mon May  1 17:19:53 BST 2017",
	"1": {
		"Description": "The HappyTrain company is planning a system that allows train passengers to order food and drinks from their seats using their own mobile phone. This will replace the train trolley (person with little wagon selling foods and drinks) that currently goes through the train. Passengers will have to tell the system which coach and seat they are in, and will have to pay by cash on delivery",
		"a": { 
			"Task":  "Explain to HappyTrain why usability is important for this system",
			"Solution": "Currently using train trolleys provides a system which is natural and easy to communicate with (since they are talking with a person). If this system were to be replaced with anything of a lower standard of usability the customers would undoubtedly be disappointed. Furthermore, if the train riders can not easily use the system they will remember to bring their own food on the train and will not purchase from HappyTrain. It may also be legally required of you to provide a system which is accessible to everybody"
		},
		"b": { 
			"Task":  "Describe a persona and a scenario for this system",
			"Solution": {
				"Persona": "Jacob works for a retail store an hour away from his home. He must therefore take the train to work each day. Some days, if he is in a rush he eats breakfast on the train",
				"Scenario": "Jacob is late so he did not have enough time to prepare breakfast this morning. He has decided to purchase food on the train. Since this is the first time the app is being used he starts downloading the app which takes a long time to download. Then he opens it to order his food. As he knows what the menu holds he has decided in advance what he would like to eat. So he clicks on the items he wants and orders them"
			}
		},
		"c": { 
			"Task":  "Provide a hierarchical task model for the task of ordering hot drinks",
			"Solution": {"_image": "2014-2015/1c_sol.png"}
		},
		"d": { 
			"Task":  "Discuss how card sorting could help you decide on groupings for the system’s information architecture",
			"Solution": "By writing each food/drink item on a card we can then divide the cards into separate groups to experiment on different group sizes and have a visual feel for how the groups look. This could also be used to see how passengers naturally think food items should be split into groups"
		},
		"e": { 
			"Task":  "Explain the difference between exact and inexact information schemes with examples from this system",
			"Solution": "Exact information schemes are categorizations of items where all the items fit exactly into 1 category. With inexact information schemes there is a degree of ambiguity. For example all the food/drinks can be split into savoury or sweet. This would be an inexact information scheme. An exact information scheme would be if we categorized the items by drink/food since all items are either food or drink and nothing is ambiguous " 
		}
	},
	"2": {
		"Description": "Consider the HappyTrain system described in Question 1",
		"a": { 
			"Task":  "You are asked to carry out a contextual inquiry to generate requirements for this system. Describe what you might do and what sorts of results you might get (providing explicit examples for this system)", 
			"Solution": "I would follow the trolley person around for a day and see what kind of questions she asks and gets asked whilst asking them to explain to me what is going on. From this I would hope to gather enough information to be able to put on the app and get an ordering on the app for people browse the system" 
		},
		"b": { 
			"Task":  "Write a questionnaire with five questions for assessing the usability of the system once it has been developed", 
			"Solution": [
				"How do you expect to get to the home page from any screen?",
				"Did you find the system easy to help with allergies concerning your food orders",
				"Did you find the system easy to use with any potential disabilities you may have",
				"Did you have any difficulty fulfilling an order?",
				"Did any part of the system confuse you?"
			]	
		},
		"c": { 
			"Task":  "Write a plan for carrying out a user test for the system once it has been developed",
			"Solution": "I would give the app to a user and ask them to fulfil an order. Whilst the user is using the app I would make sure not to give them any tips on how to use the system whilst still asking the user to explain what they are doing and thinking. Once the user has made their order I would ask them more specific questions based on observations I had made during the test" 
		}
	},
	"3": {
		"Description": "A university is designing a system to allow students to make appointments with their lecturers",
		"a": {
			"Task": "Perform a heuristic evaluation of this system, using Nielsen’s heuristics. For each problem identified, also give a short description of a possible improvement. If application of a heuristic does not yield a mistake, explain what you were looking for",
			"Solution": [
				"I was looking to see if the user is always aware of where they are in the system. Due to the title on the top of each page they are",
				"There is a simple design to the system which allows the user to focus on the current step",
				"There is no error prevention. For example error 3 could be prevented by not allowing the user to add a slot which is not available",
				"The error messages are not helpful. For example error 2 could be much more useful if it said 'The username you entered does not exist. Please verify that you entered the correct user id'",
				"There are no help pages or documentation for using the app",
				"The user does not see where they where before and where they will be on the next step",
				"There is no point where the system does not match the real world. This is a good thing",
				"There is no way to speed up the system for advanced users (i.e. by remebering orders for reperchase)",
				"The system design and way of use is not consistent since in some places 24 hour time is used and in others 12",
				"There is no way to go back to a previous step to alter mistakes"
			]
		},
		"b": {
			"Task": "Perform a cognitive walkthrough of this system, for a student called James Petersen who wants to make an appointment with Professor Judith Masthoff. Peter is available at 3pm on 16 January",
			"Solution": "Peterson will be greeted with the prompt with the option to make a booking. There is no ambiguity here so he will click on the 'Make Booking' button. Now the user has to type in the lecturer name. Should he type in the surname only? The full name? Is middle name required? Should he include the pronoun (i.e. Prof, Dr, Mr, Mrs etc.). Same issue arises with the users name. If this is the name the lecturer would see maybe he should put in the way he is called instead of his full name (some names have shorthand version which they prefer to be called). Assuming all goes well he clicks on 'Book a slot'. On the next screen it would be intuitive to be able to click on the dates. This is not possible so he clicks on 'Book a slot'. Should the month go in the second or 3rd slot? Which dates where available in the last screen? How can I set the duration of the meeting? Assuming everything goes well again, the user sees the 'Success!' page. So now he wants to note down the meeting time but it is not shown on the screen so he can't be sure if he entered the correct date and time"
		}
	}
}
